                                           WEB SCRAPING ‚Äì ASSIGNMENT 2

In [1]:
!pip install selenium

Requirement already satisfied: selenium in c:\users\admin\anaconda3\lib\site-packages (4.17.2)
Requirement already satisfied: urllib3[socks]<3,>=1.26 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (1.26.16)
Requirement already satisfied: trio~=0.17 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (0.24.0)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (0.11.1)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (2023.7.22)
Requirement already satisfied: typing_extensions>=4.9.0 in c:\users\admin\anaconda3\lib\site-packages (from selenium) (4.9.0)
Requirement already satisfied: attrs>=20.1.0 in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (22.1.0)
Requirement already satisfied: sortedcontainers in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: idna in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.4)
Requirement already satisfied: outcome in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.3.0.post0)
Requirement already satisfied: sniffio>=1.3.0 in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.3.0)
Requirement already satisfied: cffi>=1.14 in c:\users\admin\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.15.1)
Requirement already satisfied: wsproto>=0.14 in c:\users\admin\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\admin\anaconda3\lib\site-packages (from urllib3[socks]<3,>=1.26->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\users\admin\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\admin\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)

In [2]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [153]:
driver = webdriver.Chrome()

Q1: Write a python program to scrape data for ‚ÄúData Analyst‚Äù Job position in ‚ÄúBangalore‚Äù location. You
have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10
jobs data.
This task will be done in following steps:
1. First get the webpage https://www.shine.com/
2. Enter ‚ÄúData Analyst‚Äù in ‚ÄúJob title, Skills‚Äù field and enter ‚ÄúBangalore‚Äù in ‚Äúenter the location‚Äù field.
3. Then click the searchbutton.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.

In [29]:
driver.get("https://www.shine.com/")

In [33]:
Job = driver.find_element(By.CLASS_NAME,"form-control  ")
Job.send_keys('Data Analyst')

In [34]:
Loc = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
Loc.send_keys('Bangalore')

In [36]:
search = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div[1]/form/div/div[2]/div/button")
search.click()

In [37]:
Job_title = []
Job_Location = []
Company_Name = []
Experience_required = []

In [38]:
title = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in title:
    Title=i.text
    Job_title.append(Title)

In [39]:
location = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location:
    Location = i.text
    Job_Location.append(Location)

In [40]:
name = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in name:
    Name= i.text
    Company_Name.append(Name)

In [41]:
exp = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp:
    Experience = i.text
    Experience_required.append(Experience)

In [42]:
Job =({"Job Title":Job_title[:10],
       "Job Location":Job_Location[:10],
       "Company Name":Company_Name[:10],
       "Experience Required":Experience_required[:10]})

In [43]:
df = pd.DataFrame(Job)

In [44]:
df

,Job Title,Job Location,Company Name,Experience Required
0,Lead Data Analyst,Bangalore,ara resources private limited,4 to 9 Yrs
1,Data Analyst,Bangalore\n+3,diraa hr services hiring for mncs,0 to 1 Yr
2,Vacancy For Data Analyst,Bangalore\n+14,yogita staffing solution,0 to 3 Yrs
3,Data Management,Bangalore\n+18,future solution centre,15 to >25 Yrs
4,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
5,Data Modeler data,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
6,Data Engineer Ii,Bangalore\n+9,v-tech data outsourcing,0 to 1 Yr
7,Full time Opportunity-Networking Advisor-Cisco...,Bangalore\n+5,ntt data information processing ser...,10 to 20 Yrs
8,Data Modeller,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
9,Data Modeler Bangalore,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs

Q2:Write a python program to scrape data for ‚ÄúData Scientist‚Äù Job position in‚ÄúBangalore‚Äù location. You
have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.
This task will be done in following steps:
1. First get the webpage https://www.shine.com/
2. Enter ‚ÄúData Scientist‚Äù in ‚ÄúJob title, Skills‚Äù field and enter ‚ÄúBangalore‚Äù in ‚Äúenter thelocation‚Äù field.
3. Then click the search button.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.

In [115]:
driver.get("https://www.shine.com/")

In [116]:
job = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input")
job.send_keys('Data Scientist')

In [48]:
loc = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
loc.send_keys('Bangalore')

In [50]:
Search = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
Search.click()

In [51]:
Job_title = []
Job_Location = []
Company_Name = []

In [52]:
Name = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in Name:
    name = i.text
    Job_title.append(name)

In [53]:
Com_name = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]/span')
for i in Com_name:
    name = i.text
    Company_Name.append(name)

In [54]:
Loc = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in Loc:
    Location = i.text
    Job_Location.append(Location)

In [55]:
Data = ({"Job Title":Job_title[:10],
        "Job Location":Job_Location[:10],
        "Company Name":Company_Name[:10]})

In [56]:
Df = pd.DataFrame(Data)

In [57]:
Df

,Job Title,Job Location,Company Name
0,Data Scientist Recruitment,Bangalore\n+15,renuka interprises
1,Data Scientist Recruitment,Bangalore\n+15,renuka interprises
2,Data Scientist,Bangalore\n+4,acme services private limited
3,Data Scientist,Bangalore,ltimindtree limited
4,Lead Data Scientist/ Principal Data Scientist,Bangalore\n+1,fractal
5,Senior Data Scientist,Bangalore\n+1,neostats
6,Vacancy For Data Scientist Fresher and Experience,Bangalore\n+14,yogita staffing solution
7,Lead Data Scientist,Bangalore\n+1,aereo
8,Data Scientist,Bangalore\n+7,people staffing solutions
9,Data Scientist Urgent Vacancy,Bangalore\n+14,yogita staffing solution

Q3: In this question you have to scrape data using the filters available on the webpage 
 You have to use the location and salary filter.
You have to scrape data for ‚ÄúData Scientist‚Äù designation for first 10 job results.
You have to scrape the job-title, job-location, company name, experience required.
The location filter to be used is ‚ÄúDelhi/NCR‚Äù. The salary filter to be used is ‚Äú3-6‚Äù lakhs
The task will be done as shown in the below steps:
1. first get the web page https://www.shine.com/
2. Enter ‚ÄúData Scientist‚Äù in ‚ÄúSkill, Designations, and Companies‚Äù field.
3. Then click the search button.
4. Then apply the location filter and salary filter by checking the respective boxes
5. Then scrape the data for the first 10 jobs results you get.
6. Finally create a dataframe of the scrapeddata.

In [4]:
driver.get("https://www.shine.com/")

In [8]:
job = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input")
job.send_keys('Data Scientist')

In [10]:
Search = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
Search.click()

In [26]:
Filter_1 = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div/ul/li[1]/button")
Filter_1.click()

In [29]:
Loc_Fil = driver.find_element(By.XPATH,"/html/body/div[3]/div/div/div/div[3]/div/div/div/ul/li[13]/span/label")
Loc_Fil.click()
Next = driver.find_element(By.XPATH,"/html/body/div[3]/div/div/div/div[4]/button[2]")
Next.click()

In [36]:
Filter_2 = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[3]/div/div/div/div[2]/div/ul/li[3]/button")
Filter_2.click()

In [39]:
salary = driver.find_element(By.XPATH,"/html/body/div[3]/div/div/div/div[3]/div/div/div/ul/li[3]/span/label")
salary.click()
Next_1 = driver.find_element(By.XPATH,"/html/body/div[3]/div/div/div/div[4]/button[2]")
Next_1.click()

In [49]:
Job_title_1 = []
Job_Location_1 = []
Company_Name_1 = []
Experience_required_1 = []

In [50]:
Name_1 = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in Name_1:
    name = i.text
    Job_title_1.append(name)

In [51]:
Com_name_1 = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]/span')
for i in Com_name_1:
    name = i.text
    Company_Name_1.append(name)

In [52]:
Loc_1 = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in Loc_1:
    Location = i.text
    Job_Location_1.append(Location)

In [53]:
exp_1 = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp_1:
    Experience = i.text
    Experience_required_1.append(Experience)

In [55]:
Data_1 =({"Job Title":Job_title_1[:10],
       "Job Location":Job_Location_1[:10],
       "Company Name":Company_Name_1[:10],
       "Experience Required":Experience_required_1[:10]})

In [56]:
Df_1 = pd.DataFrame(Data_1)
Df_1

,Job Title,Job Location,Company Name,Experience Required
0,Data Scientist,Delhi\n+4,acme services private limited,3 to 5 Yrs
1,Hiring candidates for Marketing with Fare & Da...,Delhi\n+2,sharda it services,2 to 5 Yrs
2,Hiring for Fare & Data Analyst-Travel process,Delhi\n+2,sharda it services,1 to 6 Yrs
3,Clinical Data Analyst,Delhi\n+6,techno endura,0 to 1 Yr
4,Clinical SAS,Delhi\n+8,techno endura,0 to 2 Yrs
5,Bioanalytical Research,Delhi\n+6,techno endura,0 to 1 Yr
6,Clinical Data Management,Delhi\n+6,techno endura,0 to 1 Yr
7,Bioanalytical Research Associates,Delhi\n+6,techno endura,0 to 1 Yr
8,Junior Clinical Data Management,Delhi\n+6,techno endura,0 to 1 Yr
9,Clinical Analyst Fresher,Delhi\n+6,techno endura,0 to 1 Yr

Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
6. Brand
7. ProductDescription
8. Price
The attributes which you have to scrape is ticked marked in the below image.
To scrape the data you have to go through following steps:
1. Go to Flipkart webpage by url :https://www.flipkart.com/
2. Enter ‚Äúsunglasses‚Äù in the search fieldwhere ‚Äúsearch for products, brands and more‚Äù is written and
click the search icon
3. After that you will reach to the page having a lot of sunglasses. From this page you can scrap the
required data as usual
4. After scraping data from the first page, go to the ‚ÄúNext‚Äù Button at the bottom other page , then
click on it.
5. Now scrape data from this page as usual
6. Repeat this until you get data for 100sunglasses.

In [4]:
driver.get("https://www.flipkart.com")

In [5]:
sun = driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input")
sun.send_keys("Sunglasses")

In [6]:
search = driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button")
search.click()

In [7]:
Brand = []
Product_Description = []
Price = []

In [8]:
start = 0
end = 10
for page in range(start,end):
    nam = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in nam:
        Brand.append(i.text)
Next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
Next_button.click()
time.sleep(10)

In [9]:
start = 0
end = 10
for page in range(start,end):
    pro = driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in pro:
        Product_Description.append(i.text)
Next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
Next_button.click()
time.sleep(10)

In [10]:
start = 0
end = 10
for page in range(start,end):
    Pri = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in Pri:
        Price.append(i.text)
Next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
Next_button.click()
time.sleep(10)

In [11]:
Data_2 = ({"Brand":Brand[:100],
          "Product Description":Product_Description[:100],
           "Price":Price[:100]})

In [12]:
Df = pd.DataFrame(Data_2)

In [13]:
Df

              Brand                                Product Description   Price
0   Lenskart STUDIO  Polarized, UV Protection Rectangular Sunglasse...  ‚Çπ1,429
1            Hooper  UV Protection Retro Square Sunglasses (Free Size)    ‚Çπ599
2              SRPM  by Lenskart Polarized, UV Protection Aviator S...    ‚Çπ169
3           ROADWAY              UV Protection Aviator Sunglasses (58)    ‚Çπ129
4           ROADWAY              UV Protection Aviator Sunglasses (54)    ‚Çπ189
..              ...                                                ...     ...
95    Aarna Fashion         UV Protection Retro Square Sunglasses (54)    ‚Çπ539
96            NuVew  Polarized, UV Protection Retro Square Sunglass...  ‚Çπ2,199
97      Eyewearlabs  Polarized, UV Protection Sports, Wrap-around S...    ‚Çπ725
98         Fastrack             UV Protection Wayfarer Sunglasses (32)    ‚Çπ195
99         Fastrack            UV Protection Butterfly Sunglasses (60)    ‚Çπ549

[100 rows x 3 columns]

Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:
https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYHWAXCG&marketplace=FLIPKART
place=FLIPKARAs shown in the above page you have to scrape the tick marked attributes. These are:
1. Rating
2. Review summary
3. Full review
4. You have to scrape this data for first 100reviews.

In [70]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYHWAXCG&marketplace=FLIPKART")

In [71]:
Rating = []
Review_Summary = []
Full_Review = []

In [106]:
start = 0
end = 210
for page in range(start,end):
    ret = driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    for i in ret:
        Rating.append(i.text)
rev = driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
for i in rev:
    Review_Summary.append(i.text)
full = driver.find_elements(By.XPATH,'//div[@class="row"][2]')
for i in full:
    Full_Review.append(i.text)
Next_button = driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[11]')
Next_button.click()
time.sleep(210)

In [107]:
Data_3 = ({"Rating":Rating[:100],
          "Review Summary":Review_Summary[:100],
           "Full Review":Full_Review[:100]})

In [108]:
print(len(Rating),len(Review_Summary),len(Full_Review))

8950 108 108

In [109]:
df = pd.DataFrame(Data_3)

In [110]:
df

,Rating,Review Summary,Full Review
0,5,Perfect product!,V Good all
1,5,Wonderful,This is amazing at all
2,5,Best in the market!,Good Camera
3,5,Classy product,Camera is awesome\nBest battery backup\nA perf...
4,5,Terrific,Very very good
...,...,...,...
95,5,Perfect product!,Photos super
96,5,Terrific purchase,Value for money üòç
97,5,Just wow!,Perfect Product!!
98,5,Perfect product!,V Good all
99,5,Wonderful,This is amazing at all

Q6: Scrape data forfirst 100 sneakers you find whenyou visit flipkart.com and search for ‚Äúsneakers‚Äù inthe
search field.
You have to scrape 3 attributes of each sneaker:
1. Brand
2. ProductDescription
3. Price
As shown in the below image, you have to scrape the above attributes.

In [113]:
driver.get("https://www.flipkart.com")

In [117]:
sn = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input')
sn.send_keys("Sneakers")

In [118]:
search = driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button")
search.click()

In [119]:
Brand = []
Product_Description = []
Price = []

In [128]:
start = 0
end = 60
for page in range(start,end):
    br = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in br:
        Brand.append(i.text)
pro = driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in pro:
    Product_Description.append(i.text)
pri = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in pri:
    Price.append(i.text)
Next_button = driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[11]/span')
Next_button.click()
time.sleep(60)

In [129]:
print(len(Brand),len(Product_Description),len(Price))

10000 200 240

In [130]:
Data_4 = ({"Brand":Brand[:100],
          "Product Description":Product_Description[:100],
           "Price":Price[:100]})

In [131]:
Df = pd.DataFrame(Data_4)
Df

              Brand                                Product Description   Price
0       kardam&sons  Fashionable Canvas Casual Partywear Outdoor Sn...    ‚Çπ333
1              aadi                                 Sneakers For Women    ‚Çπ349
2         Deals4you  Trending Stylish Casual Outdoor Sneakers Shoes...    ‚Çπ299
3          URBANBOX  Casual Sneaker Shoes for Men | Soft Cushioned ...    ‚Çπ299
4          RED TAPE  Casual Sneaker Shoes for Men | Soft Cushioned ...  ‚Çπ1,709
..              ...                                                ...     ...
95  U.S. POLO ASSN.                                 Sneakers For Women  ‚Çπ1,339
96      kardam&sons                                   Sneakers For Men    ‚Çπ409
97           BRUTON         SiennaSoftrideBallerina Sneakers For Women    ‚Çπ330
98         RED TAPE  Casual Sneakers Canvas High Top Boots For Boys...  ‚Çπ2,069
99            TRUMP  Combo Pack Of 2 Casual Shoes for mens Sneakers...    ‚Çπ493

[100 rows x 3 columns]

Q7: Go to webpage https://www.amazon.in/ Enter ‚ÄúLaptop‚Äù in the search field and then click the search icon. Then set CPU Type filter to ‚ÄúIntel Core i7‚Äù as shown in the below image:
After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop:
1. Title
2. Ratings
3. Price

In [4]:
driver.get("https://www.amazon.in/")

In [5]:
lap = driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input')
lap.send_keys("Laptop")

In [6]:
search = driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
search.click()

In [13]:
cpu = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[19]/span/span[10]/li/span/a/div")
cpu.click()

In [14]:
Title = []
Ratings = []
Price = []

In [15]:
title = driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in title:
    Title.append(i.text)
Rate = driver.find_elements(By.XPATH,'//div[@class="a-row a-size-small"]/span')
for i in Rate:
    Ratings.append(i.text)
pr = driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in pr:
    Price.append(i.text)

In [16]:
print(len(Title),len(Ratings),len(Price))

24 40 24

In [17]:
Data_5 = ({"Title":Title[:10],
          "Ratings":Ratings[:10],
           "Price":Price[:10]})

In [18]:
df = pd.DataFrame(Data_5)

In [20]:
df

                                               Title Ratings   Price
0  MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...          49,990
1  ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144H...      72  73,990
2  Lenovo IdeaPad Slim 3 Intel Core i7 12th Gen 1...          62,032
3  ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...     188  59,990
4  MSI Thin GF63, Intel 12th Gen. i7-12650H, 40CM...          84,990
5  ASUS Vivobook 16X, Intel Core i7-12650H 12th G...     440  99,990
6  Acer Travelmate Business Laptop Intel Core i7-...          49,990
7  Lenovo IdeaPad Slim 5 Intel Core i7 13700H 16"...     423  87,190
8  GIGABYTE G5 MF-G2IN313SH Gaming Laptop Intel C...          75,990
9  HP Pavilion X360 11th Gen Intel Core i7 14" (3...      23  77,990

Q8: Write a python program to scrape data for Top 1000 Quotes of All Time.
The above task will be done in following steps:
1. First get the webpage https://www.azquotes.com/
2. Click on Top Quotes
3. Than scrap a) Quote b) Author c) Type Of Quotes

In [4]:
driver.get("https://www.azquotes.com/")

In [5]:
quote = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
quote.click()

In [6]:
Quote = []
Author = []
Type_of_Quotes = []

In [22]:
start = 0
end = 10
for page in range(start,end):
    quo = driver.find_elements(By.XPATH,'//a[@class="title"]')
    for i in quo:
        Quote.append(i.text)
    Aut = driver.find_elements(By.XPATH,'//div[@class="author"]')
    for i in Aut:
        Author.append(i.text)
    Type = driver.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in Type:
        Type_of_Quotes.append(i.text)
Next_botton = driver.find_element(By.XPATH,'//li[@class="next"][1]')
Next_botton.click()
time.sleep(10)

In [27]:
print(len(Quote),len(Author),len(Type_of_Quotes))

36800 1800 1800

In [24]:
Data_6 = ({"Quote":Quote[:1000],
          "Author":Author[:1000],
           "Type of Quotes":Type_of_Quotes[:1000]})

In [25]:
Df = pd.DataFrame(Data_6)

In [26]:
Df

,Quote,Author,Type of Quotes
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,"When the going gets weird, the weird turn pro.",Stephen Covey,"Life, Change, Bad Ass"
996,When a train goes through a tunnel and it gets...,John Wooden,"Basketball, Youth Of Today, Nba"
997,If you think you are too small to make a diffe...,Erica Jong,"Funny, Being Strong, Spiritual"
998,"God doesn't require us to succeed, he only req...",William James,"Inspirational, Life, Motivational"
999,Change your thoughts and you change your world.,Thomas Szasz,"Courage, Thinking, Clear"

Q9: Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/.
This task will be done in following steps:
1. First get the webpagehttps://www.jagranjosh.com/
2. Then You have to click on the GK option
3. Then click on the List of all Prime Ministers of India
4. Then scrap the mentioned data and make theDataFrame.

In [117]:
driver.get("https://www.jagranjosh.com/")

In [124]:
gk = driver.find_element(By.XPATH,'/html/body/div[1]/header/nav/div/div/div[3]/ul/li[3]/a')
gk.click()

In [128]:
gk_1 = driver.find_element(By.XPATH,'//a[@title="List of All Prime Ministers of India (1947-2024)"]')
gk_1.click()

In [129]:
Name = []
Born_Dead = []
Term_of_Office = []

In [130]:
name = driver.find_elements(By.XPATH,'//td[@valign="top"][2]')
for i in name:
    Name.append(i.text)
born = driver.find_elements(By.XPATH,'//td[@valign="top"][3]')
for i in born:
    Born_Dead.append(i.text)
term = driver.find_elements(By.XPATH,'//td[@valign="top"][4]')
for i in term:
    Term_of_Office.append(i.text)

In [131]:
print(len(Name),len(Born_Dead),len(Term_of_Office))

17 17 17

In [133]:
Data_7 = ({"Name":Name,
          "Born Dead":Born_Dead,
           "Term Of Office":Term_of_Office})

In [134]:
Df = pd.DataFrame(Data_7)
Df

,Name,Born Dead,Term Of Office
0,Jawahar Lal Nehru,(1889‚Äì1964),"15 August 1947 to 27 May 1964\n16 years, 286 days"
1,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964,\n13 days"
2,Lal Bahadur Shastri,(1904‚Äì1966),"9 June 1964 to 11 January 1966\n1 year, 216 days"
3,Indira Gandhi,(1917‚Äì1984),"24 January 1966 to 24 March 1977\n11 years, 59..."
4,Morarji Desai,(1896‚Äì1995),"24 March 1977 to 28 July 1979 \n2 year, 126 days"
5,Charan Singh,(1902‚Äì1987),28 July 1979 to 14 January 1980\n170 days
6,Indira Gandhi,(1917‚Äì1984),"14 January 1980 to 31 October 1984\n4 years, 2..."
7,Rajiv Gandhi,(1944‚Äì1991),"31 October 1984 to 2 December 1989\n5 years, 3..."
8,V. P. Singh,(1931‚Äì2008),2 December 1989 to 10 November 1990\n343 days
9,Chandra Shekhar,(1927‚Äì2007),10 November 1990 to 21 June 1991\n223 days
10,P. V. Narasimha Rao,(1921‚Äì2004),"21 June 1991 to 16 May 1996\n4 years, 330 days"
11,Atal Bihari Vajpayee,(1924- 2018),16 May 1996 to 1 June 1996\n16 days
12,H. D. Deve Gowda,(born 1933),1 June 1996 to 21 April 1997\n324 days
13,Inder Kumar Gujral,(1919‚Äì2012),21 April 1997 to 19 March 1998 \n332 days
14,Atal Bihari Vajpayee,(1924-2018),"19 March 1998 to 22 May 2004 \n6 years, 64 days"
15,Manmohan Singh,(born 1932),"22 May 2004 to 26 May 2014 \n10 years, 4 days"
16,Narendra Modi,(born 1950),26 May 2014 - 2019

Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/
This task will be done in following steps:
1. First get the webpage https://www.motor1.com/
2. Then You have to type in the search bar ‚Äô50 most expensive cars‚Äô
3. Then click on 50 most expensive cars in the world..
4. Then scrap the mentioned data and make the dataframe.

In [163]:
driver.get('https://www.motor1.com/')

In [167]:
search = driver.find_element(By.XPATH,'//input[@class="m1-search-panel-input m1-search-form-text"]')
search.send_keys("50 Most expensive cars")
search_1 = driver.find_element(By.XPATH,'//button[@class="m1-search-panel-button m1-search-form-button-animate icon-search-svg"]')
search_1.click()

In [169]:
cars = driver.find_element(By.XPATH,'//div[@class="item wcom "]')
cars.click()

In [170]:
Car_Name = []
Price = []

In [171]:
car = driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in car:
    Car_Name.append(i.text)
price = driver.find_elements(By.XPATH,'//strong')
for i in price:
    Price.append(i.text)

In [172]:
print(len(Car_Name),len(Price))

51 50

In [173]:
Data_8 = ({"Car Name":Car_Name[:50],
           "Price":Price[:50]})

In [174]:
Df =  pd.DataFrame(Data_8)
Df

                              Car Name                        Price
0                  Aston Martin Valour          Price: $1.5 Million
1                         McLaren Elva          Price: $1.7 Million
2                          Czinger 21C          Price: $1.7 Million
3                        Ferrari Monza          Price: $1.7 Million
4                   Gordon Murray T.33          Price: $1.7 Million
5                    Koenigsegg Gemera          Price: $1.7 Million
6                          Zenvo TSR-S          Price: $1.7 Million
7                   Hennessey Venom F5          Price: $1.8 Million
8                      Bentley Bacalar          Price: $1.9 Million
9        Hispano Suiza Carmen Boulogne          Price: $1.9 Million
10              Bentley Mulliner Batur          Price: $2.0 Million
11                        Deus Vayanne          Price: $2.0 Million
12                         SSC Tuatara          Price: $2.0 Million
13                         Lotus Evija          Price: $2.1 Million
14                 Aston Martin Vulcan          Price: $2.3 Million
15                          Delage D12          Price: $2.3 Million
16                 Ferrari Daytona SP3          Price: $2.3 Million
17                   McLaren Speedtail          Price: $2.3 Million
18                        Rimac Nevera          Price: $2.4 Million
19                       Pagani Utopia          Price: $2.5 Million
20                Pininfarina Battista          Price: $2.5 Million
21                  Gordon Murray T.50          Price: $2.6 Million
22                Lamborghini Countach          Price: $2.6 Million
23            Mercedes-AMG Project One          Price: $2.7 Million
24                        Zenvo Aurora          Price: $2.8 Million
25                 Aston Martin Victor          Price: $3.0 Million
26         Hennessey Venom F5 Roadster                 $3.0 Million
27                    Koenigsegg Jesko          Price: $3.0 Million
28               Aston Martin Valkyrie          Price: $3.2 Million
29           W Motors Lykan Hypersport          Price: $3.4 Million
30                       McLaren Solus                 $3.5 Million
31                    Lamborghini Sian          Price: $3.6 million
32                    Koenigsegg CC850          Price: $3.7 Million
33     Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34                  Lamborghini Veneno          Price: $4.5 Million
35                      Bugatti Bolide          Price: $4.7 Million
36           Pininfarina B95 Speedster          Price: $4.8 Million
37                     Bugatti Mistral          Price: $5.0 Million
38                 Pagani Huayra Imola          Price: $5.4 Million
39                        Bugatti Divo          Price: $5.8 Million
40                 SP Automotive Chaos          Price: $6.4 Million
41                    Pagani Codalunga          Price: $7.4 Million
42                        777 Hypercar          Price: $7.5 Million
43            Mercedes-Maybach Exelero          Price: $8.0 Million
44                  Bugatti Centodieci          Price: $9.0 Million
45             Bugatti Chiron Profil√©e         Price: $10.8 Million
46                Rolls-Royce Sweptail         Price: $12.8 Million
47            Bugatti La Voiture Noire         Price: $13.4 Million
48              Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)
49  Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)